In [4]:
import pandas as pd
data = {'Name': ['Jai', 'Princi', 'Gaurav',
 'Anuj', 'Ravi', 'Natasha', 'Riya'],
 'Age': [17, 17, 18, 17, 18, 17, 17],
 'Gender': ['M', 'F', 'M', 'M', 'M', 'F', 'F'],
 'Marks': [90, 76, 'NaN', 74, 65, 'NaN', 71]}
df = pd.DataFrame(data)
df

      Name  Age Gender Marks
0      Jai   17      M    90
1   Princi   17      F    76
2   Gaurav   18      M   NaN
3     Anuj   17      M    74
4     Ravi   18      M    65
5  Natasha   17      F   NaN
6     Riya   17      F    71

In [5]:
c = avg = 0
for ele in df['Marks']:
 if str(ele).isnumeric():
  c += 1
  avg += ele
  avg /= c
df = df.replace(to_replace="NaN",value=avg)
df

      Name  Age Gender      Marks
0      Jai   17      M  90.000000
1   Princi   17      F  76.000000
2   Gaurav   18      M  20.066667
3     Anuj   17      M  74.000000
4     Ravi   18      M  65.000000
5  Natasha   17      F  20.066667
6     Riya   17      F  71.000000

In [6]:
details = pd.DataFrame({
'ID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
'Name': ['Jagroop', 'Praveen', 'Harjot', 'Saurabh', 'Ayush', 'Pooja', 'Rahul', 'Nikita', 'Dolly', 'Mohit'],
'Branch': ['CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE', 'CSE',]})
print(details)

    ID     Name Branch
0  101  Jagroop    CSE
1  102  Praveen    CSE
2  103   Harjot    CSE
3  104  Saurabh    CSE
4  105    Ayush    CSE
5  106    Pooja    CSE
6  107    Rahul    CSE
7  108   Nikita    CSE
8  109    Dolly    CSE
9  110    Mohit    CSE

In [8]:
fees_status = pd.DataFrame({
'ID': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
'PENDING': ['5000', '250', 'NIL', '9000', '15000', 'NIL', '4500', '1800', '250', 'NIL']})
print(fees_status)

    ID PENDING
0  101    5000
1  102     250
2  103     NIL
3  104    9000
4  105   15000
5  106     NIL
6  107    4500
7  108    1800
8  109     250
9  110     NIL

In [ ]:
details